wzurawski015/esp8266-event-driven/adapters/esp8266_rtos_sdk/targets/atnel_air_esp_motherboard/main/app_main.c
#include <stddef.h>
#include <stdint.h>

#include "freertos/FreeRTOS.h"

#include "driver/uart.h"
#include "esp_log.h"

#include "board_profile.h"

#include "ev/compiler.h"
#include "ev/demo_app.h"
#include "ev/oled_actor.h"
#include "ev/mcp23008_actor.h"
#include "ev/rtc_actor.h"
#include "ev/esp8266_boot_diag.h"
#include "ev/esp8266_port_adapters.h"
#include "ev/esp8266_runtime_app.h"

#define EV_BOARD_TAG EV_BOARD_PROFILE_TAG
#define EV_BOARD_NAME EV_BOARD_PROFILE_NAME

EV_STATIC_ASSERT(EV_BOARD_ONEWIRE_GPIO != EV_BOARD_IRQ_INT0_GPIO,
                 "1-Wire and RTC/INT0 ingress must stay on distinct GPIOs");
static ev_i2c_port_t s_board_i2c_port;
static ev_irq_port_t s_board_irq_port;
static ev_onewire_port_t s_board_onewire_port;

static const ev_gpio_irq_line_config_t k_board_irq_lines[] = {
    {
        .line_id = 0U,
        .gpio_num = EV_BOARD_IRQ_INT0_GPIO,
        .trigger = EV_GPIO_IRQ_TRIGGER_FALLING,
        .pull_mode = EV_GPIO_IRQ_PULL_UP,
    },
    {
        .line_id = 1U,
        .gpio_num = EV_BOARD_IRQ_IR0_GPIO,
        .trigger = EV_GPIO_IRQ_TRIGGER_ANYEDGE,
        .pull_mode = EV_GPIO_IRQ_PULL_UP,
    },
};

static const ev_demo_app_board_profile_t k_board_runtime_profile = {
    .capabilities_mask = (EV_BOARD_HAS_I2C0 ? EV_DEMO_APP_BOARD_CAP_I2C0 : 0U) |
                         (EV_BOARD_HAS_ONEWIRE0 ? EV_DEMO_APP_BOARD_CAP_ONEWIRE0 : 0U) |
                         (EV_BOARD_HAS_GPIO_IRQ ? EV_DEMO_APP_BOARD_CAP_GPIO_IRQ : 0U) |
                         (EV_BOARD_HAS_DEEP_SLEEP_WAKE_GPIO16 ? EV_DEMO_APP_BOARD_CAP_DEEP_SLEEP_WAKE_GPIO16 : 0U),
    .hardware_present_mask = EV_BOARD_RUNTIME_HARDWARE_PRESENT_MASK,
    .supervisor_required_mask = EV_BOARD_SUPERVISOR_REQUIRED_MASK,
    .supervisor_optional_mask = EV_BOARD_SUPERVISOR_OPTIONAL_MASK,
    .i2c_port_num = EV_I2C_PORT_NUM_0,
    .rtc_sqw_line_id = EV_BOARD_RTC_SQW_LINE_ID,
    .mcp23008_addr_7bit = EV_BOARD_MCP23008_ADDR_7BIT,
    .rtc_addr_7bit = EV_BOARD_RTC_ADDR_7BIT,
    .oled_addr_7bit = EV_BOARD_OLED_ADDR_7BIT,
    .oled_controller = EV_BOARD_OLED_CONTROLLER,
};

void app_main(void)
{
    static const ev_boot_diag_config_t k_boot_diag = {
        .board_tag = EV_BOARD_TAG,
        .board_name = EV_BOARD_NAME,
        .uart_port = 0U,
        .uart_baud_rate = 115200U,
        .heartbeat_period_ms = 1000U,
    };
    ev_i2c_port_t *runtime_i2c_port = NULL;
    ev_irq_port_t *runtime_irq_port = NULL;
    ev_onewire_port_t *runtime_onewire_port = NULL;
    ev_result_t rc;

    (void)uart_set_baudrate(UART_NUM_0, 115200U);

    rc = ev_esp8266_i2c_port_init(&s_board_i2c_port, EV_BOARD_I2C_SDA_GPIO, EV_BOARD_I2C_SCL_GPIO);
    if (rc != EV_OK) {
        ESP_LOGE(EV_BOARD_TAG, "i2c adapter init failed rc=%d", (int)rc);
    } else {
        runtime_i2c_port = &s_board_i2c_port;
    }

    rc = ev_esp8266_onewire_port_init(&s_board_onewire_port, EV_BOARD_ONEWIRE_GPIO);
    if (rc != EV_OK) {
        ESP_LOGE(EV_BOARD_TAG, "onewire adapter init failed rc=%d", (int)rc);
    } else {
        runtime_onewire_port = &s_board_onewire_port;
    }

    rc = ev_esp8266_irq_port_init(&s_board_irq_port,
                                  k_board_irq_lines,
                                  (sizeof(k_board_irq_lines) / sizeof(k_board_irq_lines[0])));
    if (rc != EV_OK) {
        ESP_LOGE(EV_BOARD_TAG, "irq adapter init failed rc=%d", (int)rc);
    } else {
        runtime_irq_port = &s_board_irq_port;
    }

    ev_esp8266_runtime_app_run(&k_boot_diag, runtime_i2c_port, runtime_irq_port, runtime_onewire_port, &k_board_runtime_profile);
}
